#Смоделировать простейший калькулятор, умеющий выпонять
#4 основных арифметических операций

#Ввод 1 числа с проверкой
a = input("Введите первое число: ")
while type(a) != float:
    try:
        a = float(a)
    except ValueError:
        print("Неправильно введенные данные")
        a = input("Введите первое число: ")

#Ввод 2 чсила с проверкой
b = input("Введите второе число: ")
while type(b) != float:
    try:
        b = float(b)
    except ValueError:
        print("Неправильно введенные данные")
        b = input("Введите второе число: ")

#Выбор арифметических действий
print("Доступные операции:'+', '-', '*', '/'")
op = input("Введите знак операции: ")
while op not in ['+', '-', '*', '/']:
    print("Неправильно ввели операцию")
    op = input("Введите знак операции (+, -, *, /):")

#Вычисление и вывод с проверкой деления на 0
if op == '+':
    result = a + b
    print(f"Результат: {a} + {b} = {result}")
elif op == '-':
    result = a - b
    print(f"Результат: {a} - {b} = {result}")
elif op == '*':
    result = a * b
    print(f"Результат: {a} * {b} = {result}")
elif op == '/':
    if b == 0:
        print("Ошибка: деление на ноль")
    else:
        result = a / b
        print("Результат: {a} / {b} = {result}")