
#Дано расстояние L в сантиметрах.
#Используя операцию деления нацело,
#найти количество полных метров в нем (1 метр=100см)

#Ввод данных и обработка ошибки
while True:
    try:
        L = int(input("Введите расстояние L в сантиметрах: "))
        break
    except ValueError:
        print("Ошибка: введите целое число.")

#проверка условия и вывод результата
if L >= 0:
    meters = L // 100
    print(f"Количество полных метров: {meters}")
else:
    print("Расстояние не может быть отрицательным.")